#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

[0m[1mdata.aws_iam_role.fiap51IamRole: Reading...[0m[0m
[0m[1maws_vpc.fiap51Vpc: Refreshing state... [id=vpc-06c87c3a37ed87d6a][0m
[0m[1mdata.aws_iam_role.fiap51IamRole: Read complete after 1s [id=LabRole][0m
[0m[1maws_internet_gateway.myIgw: Refreshing state... [id=igw-0360ce0b15b440e11][0m
[0m[1maws_subnet.subnetB: Refreshing state... [id=subnet-0dc83e7e0181c20da][0m
[0m[1maws_subnet.subnetA: Refreshing state... [id=subnet-0d8372dca02aec968][0m
[0m[1maws_security_group.clusterSG: Refreshing state... [id=sg-016f126c2c5e437e7][0m
[0m[1maws_route_table.RTApp: Refreshing state... [id=rtb-0a690bd3751c4664a][0m
[0m[1maws_route_table_association.publicRTAssociationB: Refreshing state... [id=rtbassoc-0089df69882c9c6ce][0m
[0m[1maws_route_table_association.RTAssociationA: Refreshing state... [id=rtbassoc-0bfb17e737d3d0a42][0m
[0m[1maws_eks_cluster.fiap51EksCluster: Refreshing state... [id=fiap51-eks-cluster][0m
[0m[1maws_eks_access_policy_association.example: Refreshing state... [id=fiap51-eks-cluster#arn:aws:iam::742943855162:role/voclabs#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy][0m
[0m[1maws_eks_access_entry.access: Refreshing state... [id=fiap51-eks-cluster:arn:aws:iam::742943855162:role/voclabs][0m
[0m[1maws_eks_node_group.fiap51BurguerNode: Refreshing state... [id=fiap51-eks-cluster:51Burguer-node][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # aws_eks_node_group.fiap51BurguerNode[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_eks_node_group" "fiap51BurguerNode" {
      [33m~[0m[0m ami_type               = "AL2023_x86_64_STANDARD" -> (known after apply)
      [33m~[0m[0m arn                    = "arn:aws:eks:us-east-1:742943855162:nodegroup/fiap51-eks-cluster/51Burguer-node/34c9c26c-bcd5-d31e-3172-58a393dd90f9" -> (known after apply)
      [33m~[0m[0m capacity_type          = "ON_DEMAND" -> (known after apply)
      [33m~[0m[0m id                     = "fiap51-eks-cluster:51Burguer-node" -> (known after apply)
      [33m~[0m[0m instance_types         = [ [31m# forces replacement[0m[0m
          [33m~[0m[0m "t3.micro" [33m->[0m[0m "t3.medium",
        ]
      [31m-[0m[0m labels                 = {} [90m-> null[0m[0m
      [32m+[0m[0m node_group_name_prefix = (known after apply)
      [33m~[0m[0m release_version        = "1.31.2-20241121" -> (known after apply)
      [33m~[0m[0m resources              = [
          [31m-[0m[0m {
              [31m-[0m[0m autoscaling_groups              = [
                  [31m-[0m[0m {
                      [31m-[0m[0m name = "eks-51Burguer-node-34c9c26c-bcd5-d31e-3172-58a393dd90f9"
                    },
                ]
                [90m# (1 unchanged attribute hidden)[0m[0m
            },
        ] -> (known after apply)
      [33m~[0m[0m status                 = "ACTIVE" -> (known after apply)
      [31m-[0m[0m tags                   = {} [90m-> null[0m[0m
      [33m~[0m[0m tags_all               = {} -> (known after apply)
      [33m~[0m[0m version                = "1.31" -> (known after apply)
        [90m# (5 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m update_config {
          [31m-[0m[0m max_unavailable_percentage = 0 [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1mPlan:[0m 1 to add, 0 to change, 1 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @GuiMM, Action: `pull_request`*